#!/bin/bash
echo "------------------------------------------"
echo "ОТЧЕТ DEVOPS ДЛЯ MUHRIDIN"
echo "Дата: $(date)"
echo "------------------------------------------"

# Считаем процент занятого места
usage=$(df / | tail -1 | awk '{print $5}' | sed 's/%//')

echo "Диск заполнен на: $usage%"

# Условие: если больше 80% — тревога!
if [ "$usage" -gt 80 ]; then
    echo "ВНИМАНИЕ: ОПАСНО! Места осталось очень мало!"
else
    echo "Все в порядке, места достаточно."
fi
echo "------------------------------------------"
